artillery/bshStressTest.yaml
config:
  # target: http://3.131.94.4:3001
  target: http://bsh-greenfield-lb-998580826.us-east-2.elb.amazonaws.com
  # target: http://localhost:3001
  http:
    pool: 20
    # timeout: 2
  processor: "./artilleryHelpers.js"
  phases:
    - duration: 60
      arrivalRate: 20
      name: 'Warm up'
    # - duration: 60
    #   arrivalRate: 20
    #   rampTo: 110
    #   name: 'Ramp up'
    # - duration: 120
    #   arrivalRate: 120
    #   name: 'Cruise'
    # - duration: 60
    #   arrivalRate: 100
    #   rampTo: 175
    #   name: 'Heavy Ramp'
    # - duration: 120
    #   arrivalRate: 175
    #   name: 'Heavy Sustained'
    # - duration: 30
    #   arrivalRate: 10
    #   rampTo: 600
    #   name: 'Burst Ramp'
    # - duration: 60
    #   arrivalRate: 600
    #   name: 'Burst Sustained'
scenarios:
  - name: 'ArriveAtSite'
    weight: 10
    flow:
      - function: "randomProductId"
      # - get:
      #     url: '/'
      - get:
          url: "/reviews/{{ productId }}/meta"
      - get:
          url: "/reviews/{{ productId }}/list?count=100&sort=newest"

  - name: 'ChangeSortToHelpful/Relevant'
    weight: 8
    flow:
      - function: "randomProductId"
      - get:
          url: "/reviews/{{ productId }}/list?count=100&sort=helpful"
      - get:
          url: "/reviews/{{ productId }}/list?count=100&sort=newest"

  - name: 'PostReview'
    weight: 4
    flow:
      - function: "randomProductId"
      - post:
          url: "/reviews/{{ productId }}"
          beforeRequest: "prepareJSON" # prepares non-string entries for json
          json:
            summary: ''
            body: ''
            name: ''
            email: ''
            rating: ''
            recommend: ''
            characteristics: ''
            photos: ''

  - name: 'MarkReviewHelpful'
    weight: 6
    flow:
        - function: "randomReviewId"
        - put:
            url: "/reviews/helpful/{{ reviewId }}"

  - name: 'ReportAReview'
    weight: 1
    flow:
      - function: "randomReviewId"
      - put:
          url: "/reviews/report/{{ reviewId }}"

  # - name: 'ArriveAtSite'
  #   weight: 10
  #   flow:
  #     - loop:
  #       - function: "randomProductId"
  #       # - get:
  #       #     url: '/'
  #       - get:
  #           url: "/reviews/{{ productId }}/meta"
  #       - get:
  #           url: "/reviews/{{ productId }}/list?count=100&sort=newest"
  #       count: 20

  # - name: 'ChangeSortToHelpful/Relevant'
  #   weight: 8
  #   flow:
  #     - loop:
  #       - function: "randomProductId"
  #       - get:
  #           url: "/reviews/{{ productId }}/list?count=100&sort=helpful"
  #       - get:
  #           url: "/reviews/{{ productId }}/list?count=100&sort=newest"
  #       count: 50

  # - name: 'PostReview'
  #   weight: 4
  #   flow:
  #     - loop:
  #       - function: "randomProductId"
  #       - post:
  #           url: "/reviews/{{ productId }}"
  #           beforeRequest: "prepareJSON" # prepares non-string entries for json
  #           json:
  #             summary: ''
  #             body: ''
  #             name: ''
  #             email: ''
  #             rating: ''
  #             recommend: ''
  #             characteristics: ''
  #             photos: ''
  #       count: 30

  # - name: 'MarkReviewHelpful'
  #   weight: 6
  #   flow:
  #     - loop:
  #       - function: "randomReviewId"
  #       - put:
  #           url: "/reviews/helpful/{{ reviewId }}"
  #       count: 50

  # - name: 'ReportAReview'
  #   weight: 1
  #   flow:
  #     - loop:
  #       - function: "randomReviewId"
  #       - put:
  #           url: "/reviews/report/{{ reviewId }}"
  #       count: 20