artillery/bshStressTest.yaml
config:
  # replace target localhost with ec2 url after deployment
  target: http://localhost:3001
  processor: "./artilleryHelpers.js"
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 10
      rampTo: 25
      name: 'Ramp up'
    - duration: 600
      arrivalRate: 25
      name: 'Cruise'
scenarios:
  - flow:
      - function: "randomProductId"
      - get:
          url: "/reviews/{{ productId }}/meta"
      - get:
          url: "/reviews/{{ productId }}/list?count=100&sort=newest"
      - think: 2
      - get:
          url: "/reviews/{{ productId }}/list?count=100&sort=helpful"
      # - think: 5
      # - function: "randomPostData"
      # - post:
      #     url: "/reviews/{{ productId }}"
      #     beforeRequest: "prepareJSON" # prepares non-string entries for json
      #     json:
      #       summary: "{{ summary }}"
      #       body: "{{ body }}"
      #       rating: ""
      #       name: "{{ name }}"
      #       email: "{{ email }}"
      #       recommend: ""
      #       characteristics: ""
      #       photos: ""
      # - function: "randomReviewId"
      # - put:
      #     url: "/reviews/helpful/{{ reviewId }}"
      # - function: "randomReviewId"
      # - put:
      #     url: "/reviews/report/{{ reviewId }}"

      # find way to have only 1 in 1000 virtual users make a report request